---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.PreEventArgs
source: html/317786e2-4d34-7559-2f14-65406c6ed594.htm
---
# PreEventArgs Properties

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.